# Combining Python, SQL DBs and AWS

## Aim: Using python, create a DB on your AWS server, insert data into it and query that data to answer questions.

# Using Python with MYSQL DB

In [ ]:
# make sure we have the package installed
# !pip install mysql-connector-python

In [1]:
## importing 'mysql.connector' 
import mysql.connector

In [ ]:
## Connecting to the database

## connecting to the database using 'connect()' method
## it takes 3 required parameters 'host', 'user', 'passwd'
cnx = mysql.connector .connect(
    host = "localhost",
    user = "root",
    passwd = "dbms"
)

### Documentation:

https://dev.mysql.com/doc/connector-python/en/connector-python-connectargs.html

## Using a config File:

You do not want to make your credentials viewable to everyone who might see this file.  So instead of explicity stating your credentials, we want to import them from another file.

In [ ]:
import config

In [ ]:
config.pw_example

In [ ]:
## Connecting to the database

## connecting to the database using 'connect()' method
## it takes 3 required parameters 'host', 'user', 'passwd'
cnx = mysql.connector .connect(
    host = config.host,
    user = config.user,
    passwd = config.pw
)

print(cnx) # it will print a connection object if everything is fine

In [ ]:
cursor = cnx.cursor()

## Creating DB

In [ ]:
import mysql.connector
from mysql.connector import errorcode

In [ ]:
db_name = 'students'

Function to help us create a database

In [ ]:
def create_database(cursor, database):
    try:
        cursor.execute(
            "CREATE DATABASE {} DEFAULT CHARACTER SET 'utf8'".format(database))
    except mysql.connector.Error as err:
        print("Failed creating database: {}".format(err))
        exit(1)

In [ ]:
# check to see if the database already 
try:
    cursor.execute("USE {}".format(db_name))

#if the previous line fails because there isn't a db by that name run this line

except mysql.connector.Error as err:
    print("Database {} does not exists.".format(db_name))
    if err.errno == errorcode.ER_BAD_DB_ERROR:
        create_database(cursor, db_name)
        print("Database {} created successfully.".format(db_name))
        cnx.database = db_name
    else:
        print(err)
        exit(1)

### Creating tables

In [ ]:
DB_NAME = 'employees'

TABLES = {}
TABLES['employees'] = (
    "CREATE TABLE employees ("
    "  emp_no int(11) NOT NULL AUTO_INCREMENT,"
    "  birth_date date NOT NULL,"
    "  first_name varchar(14) NOT NULL,"
    "  last_name varchar(16) NOT NULL,"
    "  gender enum('M','F') NOT NULL,"
    "  hire_date date NOT NULL,"
    "  PRIMARY KEY (emp_no)"
    ") ENGINE=InnoDB")

TABLES['departments'] = (
    "CREATE TABLE departments ("
    "  dept_no char(4) NOT NULL,"
    "  dept_name varchar(40) NOT NULL,"
    "  PRIMARY KEY (dept_no), UNIQUE KEY dept_name (dept_name)"
    ") ENGINE=InnoDB")

TABLES['salaries'] = (
    "CREATE TABLE salaries ("
    "  emp_no int(11) NOT NULL,"
    "  salary int(11) NOT NULL,"
    "  from_date date NOT NULL,"
    "  to_date date NOT NULL,"
    "  PRIMARY KEY (emp_no,from_date), KEY emp_no (emp_no),"
    "  CONSTRAINT salaries_ibfk_1 FOREIGN KEY (emp_no) "
    "     REFERENCES employees (emp_no) ON DELETE CASCADE"
    ") ENGINE=InnoDB")

TABLES['dept_emp'] = (
    "CREATE TABLE dept_emp ("
    "  emp_no int(11) NOT NULL,"
    "  dept_no char(4) NOT NULL,"
    "  from_date date NOT NULL,"
    "  to_date date NOT NULL,"
    "  PRIMARY KEY (emp_no,dept_no), KEY emp_no (emp_no),"
    "  KEY dept_no (dept_no),"
    "  CONSTRAINT dept_emp_ibfk_1 FOREIGN KEY (emp_no) "
    "     REFERENCES employees (emp_no) ON DELETE CASCADE,"
    "  CONSTRAINT dept_emp_ibfk_2 FOREIGN KEY (dept_no) "
    "     REFERENCES departments (dept_no) ON DELETE CASCADE"
    ") ENGINE=InnoDB")

TABLES['dept_manager'] = (
    "  CREATE TABLE dept_manager ("
    "  dept_no char(4) NOT NULL,"
    "  emp_no int(11) NOT NULL,"
    "  from_date date NOT NULL,"
    "  to_date date NOT NULL,"
    "  PRIMARY KEY (emp_no,dept_no),"
    "  KEY emp_no (emp_no),"
    "  KEY dept_no (dept_no),"
    "  CONSTRAINT dept_manager_ibfk_1 FOREIGN KEY (emp_no) "
    "     REFERENCES employees (emp_no) ON DELETE CASCADE,"
    "  CONSTRAINT dept_manager_ibfk_2 FOREIGN KEY (dept_no) "
    "     REFERENCES departments (dept_no) ON DELETE CASCADE"
    ") ENGINE=InnoDB")

TABLES['titles'] = (
    "CREATE TABLE titles ("
    "  emp_no int(11) NOT NULL,"
    "  title varchar(50) NOT NULL,"
    "  from_date date NOT NULL,"
    "  to_date date DEFAULT NULL,"
    "  PRIMARY KEY (emp_no,title,from_date), KEY emp_no (emp_no),"
    "  CONSTRAINT titles_ibfk_1 FOREIGN KEY (emp_no)"
    "     REFERENCES employees (emp_no) ON DELETE CASCADE"
    ") ENGINE=InnoDB")

In [ ]:
TABLES['employees']

In [ ]:
cnx = mysql.connector.connect(
    host = config.host,
    user = config.user,
    passwd = config.password,
    database = DB_NAME
)
cursor = cnx.cursor()

In [ ]:
for table_name in TABLES:
    table_description = TABLES[table_name]
    try:
        print("Creating table {}: ".format(table_name), end='')
        cursor.execute(table_description)
    except mysql.connector.Error as err:
        if err.errno == errorcode.ER_TABLE_EXISTS_ERROR:
            print("already exists.")
        else:
            print(err.msg)
    else:
        print("OK")

cursor.close()
cnx.close()

## Inserting Data

In [ ]:
from datetime import date, datetime, timedelta

#since we closed the connection, we need to reinstatiate it
cnx = mysql.connector.connect(
    host = config.host,
    user = config.user,
    passwd = config.password,
    database = db_name
)
cursor = cnx.cursor()

In [ ]:
tomorrow = datetime.now().date() + timedelta(days=1)

In [ ]:
# insert statement to add an employee
add_employee = ("INSERT INTO employees "
               "(first_name, last_name, hire_date, gender, birth_date) "
               "VALUES (%s, %s, %s, %s, %s)")

#insert statement to add a salary
add_salary = ("INSERT INTO salaries "
              "(emp_no, salary, from_date, to_date) "
              "VALUES (%(emp_no)s, %(salary)s, %(from_date)s, %(to_date)s)")

#data to insert for one employee
data_employee = ('Geert', 'Vanderkelen', tomorrow, 'M', date(1977, 6, 14))

In [ ]:
# Insert new employee
cursor.execute(add_employee, data_employee)
# Make sure data is committed to the database
cnx.commit()

In [ ]:
# grabs the id of the employee we just inserted so we can use it to input salary data
emp_no = cursor.lastrowid

In [ ]:

# create salary information
data_salary = {
  'emp_no': emp_no,
  'salary': 50000,
  'from_date': tomorrow,
  'to_date': date(9999, 1, 1),
}

In [ ]:

#Insert that salary information
cursor.execute(add_salary, data_salary)

# Make sure data is committed to the database
cnx.commit()

## Insert Many

If you have a list of records that you would like to input, there are two ways you can do this.  YOu can loop over each record in python and execute each record, or you can use the `executemany()` method.  

`cursor.executemany(operation, list_of_params)`

In [ ]:
#create a list of records

data = [
  ('Jane', date(2005, 2, 12)),
  ('Joe', date(2006, 5, 23)),
  ('John', date(2010, 10, 3)),
]

In [ ]:
#create the insert statment
stmt = "INSERT INTO employees (first_name, hire_date) VALUES (%s, %s)"

In [ ]:
#insert all of the records and commit it
cursor.executemany(stmt, data)
cnx.commit()

In [ ]:
#Close the connection # Just do when completely finished

cursor.close()
cnx.close()

## Quyerying the DB

In [ ]:
cnx = mysql.connector.connect(
    host = config.host,
    user = config.user,
    passwd = config.password,
    database = DB_NAME
)
cursor = cnx.cursor()

In [ ]:

query = ("SELECT first_name, last_name, hire_date FROM employees "
         "WHERE hire_date BETWEEN %s AND %s")

hire_start = datetime.date(2006, 1, 1)
hire_end = datetime.date(2006, 12, 31)

cursor.execute(query, (hire_start, hire_end))

### How to read the data from your query.

You can use the `fetchone()`, `fetchmany()`, or `fetchall()` methods.

The `fetchone()` method returns the next row of a query result set or `None` in case there is no row left.

        row = cursor.fetchone()
 
        while row is not None:
            print(row)
            row = cursor.fetchone()

In case the number of rows in the table is small, you can use the `fetchall()` method to fetch all rows from the database table.

        rows = cursor.fetchall()
 
        print('Total Row(s):', cursor.rowcount)
        for row in rows:
            print(row)

**Why might you use a fetchone() when you have a query that will return multiple rows?**

For a relatively big table, it takes time to fetch all rows and return the entire result set. In addition, `fetchall()` needs to allocate enough memory to store the entire result set in the memory, which is not efficient.

MySQL Connector/Python has the `fetchmany()` method that returns the next number of rows (n) of the result set, which allows you to balance between retrieval time and memory space.

First, develop a generator that chunks the database calls into a series of `fetchmany()` calls:

In [ ]:
def iter_row(cursor, size=10):
    while True:
        rows = cursor.fetchmany(size)
        if not rows:
            break
        for row in rows:
            yield row

Second, use the  iter_row() generator to fetch 10 rows at a time :

`cursor.execute("SELECT * FROM books")`
 
`for row in iter_row(cursor, 10):
    print(row)`

In [ ]:
#in practice #If you want to hold the data you must assign it to a variable or itll just display

data = cursor.fetchall()

In [ ]:
print(data)

In [ ]:
cursor.close()
cnx.close()

## Applied: Working with our student data

### Import our student data

In [4]:
import config

In [2]:
import json

f=open('students.json','r')
data=json.load(f)

In [63]:

## Connecting to the database

## connecting to the database using 'connect()' method
## it takes 3 required parameters 'host', 'user', 'passwd'
cnx = mysql.connector .connect(
    host = config.host,
    user = config.user,
    passwd = config.pw,
   database = 'students',
    #use_pure = True
)

print(cnx) # it will print a connection object if everything is fine

cursor = cnx.cursor(buffered=True)

<mysql.connector.connection_cext.CMySQLConnection object at 0x106b907d0>

In [9]:
cursor.execute("CREATE DATABASE students")

DatabaseError: 1007 (HY000): Can't create database 'students'; database exists

In [ ]:
db_name = 'students'

In [ ]:
cnx.database = 'students'

In [11]:
create_query = """CREATE TABLE students
                    (name VARCHAR(50),
                    dob DATE,
                    fav_food VARCHAR(100),
                    birthplace VARCHAR(50),
                    in_nyc FLOAT);"""

In [12]:
cursor.execute(create_query)

In [ ]:
#examine that student data

### Determine how you should define your table to hold the data



### Create a connection and cursor to AWS db

In [ ]:
# done above

### Create a table for our student info

In [ ]:
#done above
create_query = """

);
"""

### Now that we have created our table we need to insert our data into the table.

We can't just pass the execute query a list of dictioanries,  We need to parse through it first.

Take one student and identify how you would parse that information into a usable format.

In [ ]:
student = data[0]

Now use a for loop to loop over all of data and return a list that we can use for `executemany()`.

**If all of your data isn't formatted as expected, this will cause your loop to fail**  you might have to account for 'bad data' in your for loop.

In [ ]:
student

In [ ]:
(student['name'], student['dob'], student['fav_food'], student['birthplace'], student['years_in_nyc']  )

In [13]:
students_list = []
    
for student in data:
    #print(student['name'], student.keys()) #This was done because there was an error with Key:dob and this shows where the error is
    try:
        student_tuple= (student['name'], student['dob'], student['fav_food'], student['birthplace'], student['years_in_nyc'])
        students_list.append(student_tuple)
    except:
        student_tuple= (student['name'], student['birthdate'], student['fav_food'], student['birthplace'], student['years_in_nyc'])
        students_list.append(student_tuple)

In [ ]:
#Option 2
#for student in data:
#    if: 'birthdate' in student:
#            student['dob'] = student['birthdate']
#    student_tuple= (student['name'], student['dob'], student['fav_food'], student['birthplace'], student['years_in_nyc'])
#    students_list.append(student_tuple)

Now that we have this list of tuples, lets use `executemany()` to insert the data.

In [ ]:
students_list

In [14]:
statement = """INSERT INTO students (name, dob, fav_food, birthplace, in_nyc) 
                VALUES (%s, %s, %s, %s, %s)"""

In [15]:
cursor.executemany(statement, students_list)

In [16]:
cnx.commit()

Now that we have the data in the database, we can write

In [27]:
cursor.execute("SELECT * FROM students;")

In [28]:
cursor.fetchall()

[('Anastasia Gorina',
  datetime.date(1991, 7, 19),
  'oysters',
  'St. Petersburg, Russia',
  5.0),
 ('Andres M Chaves',
  datetime.date(1983, 1, 22),
  'chocolate',
  'Bogota, CU',
  6.0),
 ('Andrew Triola',
  datetime.date(1989, 10, 17),
  'baked ziti',
  'Washington DC',
  3.0),
 ('Anita Guo',
  datetime.date(1990, 12, 17),
  'Seafood Boil',
  'Fuzhou, China',
  16.0),
 ('Askhat Yktybaev', None, 'cheese cake', 'Bishkek, Kyrgyzstan', 3.0),
 ('Aviva Sally Mazurek',
  datetime.date(1994, 4, 29),
  'Burgers',
  'Bronx, NY',
  2.0),
 ('Ben Johnson-Laird',
  datetime.date(1900, 4, 1),
  'Roast Beef and Yorkshire pudding',
  'London, UK',
  21.0),
 ('Brittany Fowle',
  datetime.date(1992, 5, 27),
  'noodles',
  'Painesville, OH',
  9.0),
 ('Chadwick Balloo',
  datetime.date(1991, 7, 29),
  'chicken',
  'Queens, New York',
  1.0),
 ('Ed Haracz', datetime.date(1995, 2, 24), 'pizza', 'Glen Ridge, NJ', 0.0),
 ('Grace Park', datetime.date(1990, 4, 5), 'sushi', 'Flushing, NY', 29.0),
 ('Jackson Bull',
  datetime.date(1987, 11, 28),
  'fried_chicken',
  'Nashville, TN',
  8.0),
 ('Julia Chong',
  datetime.date(1996, 11, 27),
  'soup dumplings',
  'Portland, OR',
  1.5),
 ('Owen Peng', datetime.date(1996, 5, 4), 'Burgers', 'OKC, OK', 13.0),
 (' Raphael Krantz',
  datetime.date(1973, 3, 21),
  'lasagna',
  'New York City',
  31.0),
 ('Rob Zifchak', datetime.date(1989, 8, 2), 'Sushi', 'Santa Monica, CA', 1.5),
 ('Robert Alterman',
  datetime.date(1996, 3, 16),
  'chicken fingers',
  'New Rochelle, NY',
  3.0),
 ('Sean Abu Wilson',
  datetime.date(1985, 2, 6),
  'strawberry cake',
  'Birmingham, AL',
  8.0)]

### Write queries to answer the following questions:

**Questions**
- Which student has the most siblings? NA
- How many students are only children? NA
- Which 3 students have lived in NYC the shortest amount of time?
- How many students are native New Yorkers?
- Do any two students have the same favorite food?
- Which student was born closest to the cohort's graduation date?

In [29]:
#Which 3 students have lived in NYC the shortest amount of time?
cursor.execute("SELECT * FROM students ORDER BY in_nyc LIMIT 3;")

In [30]:
cursor.fetchall()

[('Ed Haracz', datetime.date(1995, 2, 24), 'pizza', 'Glen Ridge, NJ', 0.0),
 ('Chadwick Balloo',
  datetime.date(1991, 7, 29),
  'chicken',
  'Queens, New York',
  1.0),
 ('Julia Chong',
  datetime.date(1996, 11, 27),
  'soup dumplings',
  'Portland, OR',
  1.5)]

In [ ]:
#How many students are native New Yorkers?

In [39]:
cursor.execute("SELECT * FROM students WHERE birthplace LIKE '%NY%' OR birthplace LIKE '%NEW YORK%';")

In [40]:
cursor.fetchall()

[('Aviva Sally Mazurek',
  datetime.date(1994, 4, 29),
  'Burgers',
  'Bronx, NY',
  2.0),
 ('Chadwick Balloo',
  datetime.date(1991, 7, 29),
  'chicken',
  'Queens, New York',
  1.0),
 ('Grace Park', datetime.date(1990, 4, 5), 'sushi', 'Flushing, NY', 29.0),
 (' Raphael Krantz',
  datetime.date(1973, 3, 21),
  'lasagna',
  'New York City',
  31.0),
 ('Robert Alterman',
  datetime.date(1996, 3, 16),
  'chicken fingers',
  'New Rochelle, NY',
  3.0)]

In [ ]:
#Do any two students have the same favorite food?

In [90]:
#cursor.execute("""SELECT name, fav_food FROM students s1 WHERE fav_food IN (SELECT fav_food FROM students s2 WHERE s2.name != s1.name);""")
cursor.execute("select fav_food, count(*) from students group by fav_food having count(*) >1;")

In [91]:
cursor.fetchall()

[('Burgers', 2), ('sushi', 2)]

In [ ]:
#Which student was born closest to the cohort's graduation date?

In [105]:
cursor.execute("""SELECT name, dob 
                FROM students
                WHERE name NOT LIKE '%Askhat%'
                ORDER BY dob DESC 
                LIMIT 1;""")

In [106]:
cursor.fetchall()

[('Julia Chong', datetime.date(1996, 11, 27))]

In [98]:
cursor.execute("""SELECT name ,dob, LEAST(ABS(DAYOFYEAR(dob) - 66), ABS((DAYOFYEAR(dob) + 365) - 66) , ABS(DAYOFYEAR(dob) - (66 + 365))) FROM students s1 ORDER BY 3;""")

In [99]:
cursor.fetchall()

[('Askhat Yktybaev', None, None),
 ('Robert Alterman', datetime.date(1996, 3, 16), 10),
 ('Ed Haracz', datetime.date(1995, 2, 24), 11),
 (' Raphael Krantz', datetime.date(1973, 3, 21), 14),
 ('Ben Johnson-Laird', datetime.date(1900, 4, 1), 25),
 ('Sean Abu Wilson', datetime.date(1985, 2, 6), 29),
 ('Grace Park', datetime.date(1990, 4, 5), 29),
 ('Andres M Chaves', datetime.date(1983, 1, 22), 44),
 ('Aviva Sally Mazurek', datetime.date(1994, 4, 29), 53),
 ('Owen Peng', datetime.date(1996, 5, 4), 59),
 ('Anita Guo', datetime.date(1990, 12, 17), 80),
 ('Brittany Fowle', datetime.date(1992, 5, 27), 82),
 ('Jackson Bull', datetime.date(1987, 11, 28), 99),
 ('Julia Chong', datetime.date(1996, 11, 27), 99),
 ('Anastasia Gorina', datetime.date(1991, 7, 19), 134),
 ('Andrew Triola', datetime.date(1989, 10, 17), 141),
 ('Chadwick Balloo', datetime.date(1991, 7, 29), 144),
 ('Rob Zifchak', datetime.date(1989, 8, 2), 148)]